Script started on Mon 09 Feb 2015 09:38:24 PM PST
[?1034hbash-4.1$ mk list2.c
CSOURCE=environ.c EXECBIN=environ
+ cid + environ.c
+ checksource environ.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 environ.c -o environ -lm
+ tee environ.c.log
environ.c: In function â€˜mainâ€™:
environ.c:6:14: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main(int argc, char **argv)
              ^
environ.c:6:27: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main(int argc, char **argv)
                           ^
+ set +x
============================================================
CSOURCE=err2.c EXECBIN=err2
+ cid + err2.c
+ checksource err2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err2.c -o err2 -lm
+ tee err2.c.log
err2.c: In function â€˜mainâ€™:
err2.c:6:14: warning: initialization makes pointer from integer without a cast [enabled by default]
    char *p = 20;
              ^
+ set +x
============================================================
CSOURCE=err.c EXECBIN=err
+ cid + err.c
+ checksource err.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 err.c -o err -lm
+ tee err.c.log
err.c: In function â€˜fooâ€™:
err.c:6:9: warning: unused variable â€˜pâ€™ [-Wunused-variable]
    int *p = &x;
         ^
err.c: In function â€˜barâ€™:
err.c:11:11: warning: â€˜aâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("%d %p\n", a, p);
           ^
err.c:11:11: warning: â€˜pâ€™ is used uninitialized in this function [-Wuninitialized]
+ set +x
============================================================
CSOURCE=list1.c EXECBIN=list1
+ cid + list1.c
+ checksource list1.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list1.c -o list1 -lm
+ tee list1.c.log
list1.c: In function â€˜mainâ€™:
list1.c:15:7: warning: implicit declaration of function â€˜mallocâ€™ [-Wimplicit-function-declaration]
       node *node = malloc (sizeof (struct node));
       ^
list1.c:15:20: warning: incompatible implicit declaration of built-in function â€˜mallocâ€™ [enabled by default]
       node *node = malloc (sizeof (struct node));
                    ^
list1.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list2.c EXECBIN=list2
+ cid + list2.c
+ checksource list2.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm
+ tee list2.c.log
list2.c: In function â€˜mainâ€™:
list2.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
+ tee list3.c.log
list3.c: In function â€˜mainâ€™:
list3.c:13:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=list4.c EXECBIN=list4
+ cid + list4.c
+ checksource list4.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list4.c -o list4 -lm
+ tee list4.c.log
list4.c: In function â€˜mainâ€™:
list4.c:20:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
+ set +x
============================================================
CSOURCE=malloc.c EXECBIN=malloc
+ cid + malloc.c
+ checksource malloc.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 malloc.c -o malloc -lm
+ tee malloc.c.log
malloc.c: In function â€˜mainâ€™:
malloc.c:12:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
malloc.c:12:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
+ set +x
============================================================
CSOURCE=uninit.c EXECBIN=uninit
+ cid + uninit.c
+ checksource uninit.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 uninit.c -o uninit -lm
+ tee uninit.c.log
uninit.c: In function â€˜mainâ€™:
uninit.c:6:15: warning: unused parameter â€˜argcâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
               ^
uninit.c:6:28: warning: unused parameter â€˜argvâ€™ [-Wunused-parameter]
 int main (int argc, char **argv) {
                            ^
uninit.c:8:11: warning: â€˜pointerâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("pointer=%p\n", pointer);
           ^
uninit.c:11:11: warning: â€˜fooâ€™ is used uninitialized in this function [-Wuninitialized]
    printf ("foo=%d\n", foo);
           ^
+ set +x
============================================================
bash-4.1$ valgrind list2 foo bar
==22839== Memcheck, a memory error detector
==22839== Copyright (C) 2002-2013, and GNU GPL'd, by Julian Seward et al.
==22839== Using Valgrind-3.9.0 and LibVEX; rerun with -h for copyright info
==22839== Command: list2 foo bar
==22839== 
0x4c2c180->node {word=0xfff0001e9->[MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:], link=0x4c2c130}
0x4c2c130->node {word=(nil)->[(null)], link=0x4c2c0e0}
0x4c2c0e0->node {word=0xfff0001e5->[bar], link=0x4c2c090}
0x4c2c090->node {word=0xfff0001e1->[foo], link=0x4c2c040}
==22839== Conditional jump or move depends on uninitialised value(s)
==22839==    at 0x400682: main (list2.c:22)
==22839== 
==22839== 
==22839== HEAP SUMMARY:
==22839==     in use at exit: 80 bytes in 5 blocks
==22839==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==22839== 
==22839== LEAK SUMMARY:
==22839==    definitely lost: 16 bytes in 1 blocks
==22839==    indirectly lost: 64 bytes in 4 blocks
==22839==      possibly lost: 0 bytes in 0 blocks
==22839==    still reachable: 0 bytes in 0 blocks
==22839==         suppressed: 0 bytes in 0 blocks
==22839== Rerun with --leak-check=full to see details of leaked memory
==22839== 
==22839== For counts of detected and suppressed errors, rerun with: -v
==22839== Use --track-origins=yes to see where uninitialised values come from
==22839== ERROR SUMMARY: 1 errors from 1 contexts (suppressed: 6 from 6)
bash-4.1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/o/oburov/private/cmps012b/lab5/code/list2...done.
(gdb) gdb[K[K[Kbreak 26
Breakpoint 1 at 0x400684: file list2.c, line 26.
(gdb) run foo vat[K[K[Kbar
Starting program: /afs/cats.ucsc.edu/users/o/oburov/private/cmps012b/lab5/code/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.
0x601090->node {word=0x7fffffffe251->[MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:], link=0x601070}
0x601070->node {word=(nil)->[(null)], link=0x601050}
0x601050->node {word=0x7fffffffe24d->[bar], link=0x601030}
0x601030->node {word=0x7fffffffe249->[foo], link=0x601010}

Breakpoint 1, main (argc=3, argv=0x7fffffffdf28) at list2.c:26
26	   return 9;
(gdb) where
#0  main (argc=3, argv=0x7fffffffdf28) at list2.c:26
(gdb) list
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) list list2.c:23
18	      node->word = argv[argi];
19	      node->link = head;
20	      head = node;
21	   }
22	   for (node *curr = head; curr->link != NULL; curr = curr->link) {
23	      printf ("%p->node {word=%p->[%s], link=%p}\n",
24	              curr, curr->word, curr->word, curr->link);
25	   }
26	   return 9;
27	}
(gdb) print head
$1 = (node *) 0x601090
(gdb) bt
#0  main (argc=3, argv=0x7fffffffdf28) at list2.c:26
(gdb) print head
$2 = (node *) 0x601090
(gdb) pe[Krint *head
$3 = {word = 0x7fffffffe251 "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:", link = 0x601070}
(gdb) print ([K*(head->word)
$4 = 77 'M'
(gdb) print head->link->link->link
$5 = (node *) 0x601030
(gdb) print head->link->link->link[C)(head->link->link->link)[C[C[C[C[C[C[C[C[C[C[C[C[C*(head->link->link->link)[C[C[C[C[C[C[C[C[C[C[C[C[C
$6 = {word = 0x7fffffffe249 "foo", link = 0x601010}
(gdb) e[Kquit
A debugging session is active.

	Inferior 1 [process 23009] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Mon 09 Feb 2015 09:40:56 PM PST
