Script started on Mon 09 Feb 2015 09:41:06 PM PST
[?1034hbash-4.1$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-47.el6
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/o/oburov/private/cmps012b/lab5/code/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/o/oburov/private/cmps012b/lab5/code/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdf28) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffdf28
(gdb) print argv[0]
$3 = 0x7fffffffe206 "/afs/cats.ucsc.edu/users/o/oburov/private/cmps012b/lab5/code/list2"
(gdb) print argv[1]
$4 = 0x7fffffffe249 "foo"
(gdb) print argv[2]
$5 = 0x7fffffffe24d "bar"
(gdb) print argv[3]
$6 = 0x0
(gdb) print argv[4]
$7 = 0x7fffffffe251 "MANPATH=/opt/rh/devtoolset-2/root/usr/share/man:"
(gdb) print argv[5]
$8 = 0x7fffffffe282 "HOSTNAME=unix1.lt.ucsc.edu"
(gdb) print argv[6]
$9 = 0x7fffffffe29d "GNUPLOT_DEFAULT_GDFONT=LiberationSans-Regular"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 23371] will be killed.

Quit anyway? (y or n) y
bash-4.1$ exit
exit

Script done on Mon 09 Feb 2015 09:41:59 PM PST
